spec/support/create_shipment_dd_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:de="http://de.ws.intraship" xmlns:is="http://dhl.de/webservice/is_base_de" xmlns:cis="http://dhl.de/webservice/cisbase">
  <soapenv:Header>
    <cis:Authentification>
      <cis:user>user</cis:user>
      <cis:signature>signature</cis:signature>
      <cis:accountNumber>ekp12345|01|01</cis:accountNumber>
      <cis:type>0</cis:type>
    </cis:Authentification>
  </soapenv:Header>
  <soapenv:Body>
    <de:CreateShipmentDDRequest>
      <cis:Version>
        <cis:majorRelease>1</cis:majorRelease>
        <cis:minorRelease>0</cis:minorRelease>
      </cis:Version>
      <ShipmentOrder>
        <SequenceNumber>1</SequenceNumber>
        <Shipment>
          <ShipmentDetails>
            <ProductCode>EPN</ProductCode>
            <ShipmentDate>2015-03-13</ShipmentDate>
            <cis:EKP>ekp12345</cis:EKP>
            <Attendance>
              <cis:partnerID>01</cis:partnerID>
            </Attendance>
            <ShipmentItem>
              <WeightInKG>2.5</WeightInKG>
              <LengthInCM>11</LengthInCM>
              <WidthInCM>13</WidthInCM>
              <HeightInCM>3</HeightInCM>
              <PackageType>PK</PackageType>
            </ShipmentItem>
          </ShipmentDetails>
          <Shipper>
            <Company>
              <cis:Company>
                <cis:name1>Team Europe Ventures</cis:name1>
              </cis:Company>
            </Company>
            <Address>
              <cis:streetName>Mohrenstraße</cis:streetName>
              <cis:streetNumber>60</cis:streetNumber>
              <cis:Zip>
                <cis:germany>10117</cis:germany>
              </cis:Zip>
              <cis:city>Berlin</cis:city>
              <cis:Origin>
                <cis:countryISOCode>DE</cis:countryISOCode>
              </cis:Origin>
            </Address>
            <Communication>
              <cis:email>info@teameurope.net</cis:email>
              <cis:contactPerson>John Smith</cis:contactPerson>
            </Communication>
          </Shipper>
          <Receiver>
            <Company>
              <cis:Person>
                <cis:salutation/>
                <cis:firstname>John</cis:firstname>
                <cis:lastname>Doe</cis:lastname>
              </cis:Person>
            </Company>
            <Address>
              <cis:streetName>Mainstreet</cis:streetName>
              <cis:streetNumber>10</cis:streetNumber>
              <cis:careOfName>Appartment 2a</cis:careOfName>
              <cis:Zip>
                <cis:germany>90210</cis:germany>
              </cis:Zip>
              <cis:city>Springfield</cis:city>
              <cis:Origin>
                <cis:countryISOCode>DE</cis:countryISOCode>
              </cis:Origin>
            </Address>
            <Communication>
              <cis:email>john.doe@example.com</cis:email>
              <cis:contactPerson></cis:contactPerson>
            </Communication>
          </Receiver>
        </Shipment>
      </ShipmentOrder>
    </de:CreateShipmentDDRequest>
  </soapenv:Body>
</soapenv:Envelope>
